Repository: LiJiaHua1024/ModlessChatTrans
Catalog: i18n/*.po
Languages: de_de, es_es, ja_jp, pt_br, ru_ru

# 消息翻译结果
source: Message Translation Results
de_de: Ergebnis der Nachrichtenübersetzung
es_es: Resultado de la traducción de mensajes
ja_jp: メッセージ翻訳結果
pt_br: Resultado da tradução da mensagem
ru_ru: Результат перевода сообщения

# 消息
source: Message
de_de: Nachricht
es_es: Mensaje
ja_jp: メッセージ
pt_br: Mensagem
ru_ru: Сообщение

# 输入消息...
source: Enter message...
de_de: Nachricht eingeben...
es_es: Escribe un mensaje...
ja_jp: メッセージを入力...
pt_br: Digite a mensagem...
ru_ru: Введите сообщение...

# 要发送的消息翻译完成，翻译结果已复制到剪切板
source: Message translation completed. The result has been copied to the clipboard.
de_de: Die zu sendende Nachricht wurde übersetzt; das Ergebnis wurde in die Zwischenablage kopiert.
es_es: La traducción del mensaje a enviar se ha completado; el resultado se ha copiado al portapapeles.
ja_jp: 送信するメッセージの翻訳が完了しました。結果はクリップボードにコピーされました。
pt_br: A tradução da mensagem a ser enviada foi concluída; o resultado foi copiado para a área de transferência.
ru_ru: Перевод сообщения для отправки завершён, результат скопирован в буфер обмена

# 下载失败
source: Download failed
de_de: Download fehlgeschlagen
es_es: Descarga fallida
ja_jp: ダウンロードに失敗しました
pt_br: Falha no download
ru_ru: Ошибка загрузки

# 消息捕获设置
source: Message Capture Settings
de_de: Einstellungen zur Nachrichtenerfassung
es_es: Configuración de captura de mensajes
ja_jp: メッセージキャプチャ設定
pt_br: Configurações de captura de mensagens
ru_ru: Настройки перехвата сообщений

# Minecraft 日志位置：
source: Minecraft log location:
de_de: Minecraft-Logspeicherort:
es_es: Ubicación del registro de Minecraft:
ja_jp: Minecraft ログの場所：
pt_br: Local do log do Minecraft:
ru_ru: Расположение журнала Minecraft:

# 请选择Minecraft日志文件夹路径
source: Please select the Minecraft log folder path
de_de: Bitte den Ordnerpfad des Minecraft-Logs auswählen
es_es: Selecciona la ruta de la carpeta de registros de Minecraft
ja_jp: Minecraft のログフォルダーパスを選択してください
pt_br: Selecione o caminho da pasta de logs do Minecraft
ru_ru: Выберите путь к папке журнала Minecraft

# 源语言：
source: Source language:
de_de: Ausgangssprache:
es_es: Idioma de origen:
ja_jp: ソース言語：
pt_br: Idioma de origem:
ru_ru: Исходный язык:

# 目标语言：
source: Target language:
de_de: Zielsprache:
es_es: Idioma de destino:
ja_jp: ターゲット言語：
pt_br: Idioma de destino:
ru_ru: Целевой язык:

# 日志编码：
source: Log encoding:
de_de: Log-Kodierung:
es_es: Codificación del registro:
ja_jp: ログのエンコード：
pt_br: Codificação do log:
ru_ru: Кодировка журнала:

# 建议选择自动检测（auto），如果无效可以尝试手动指定GBK等编码
source: It is recommended to choose auto-detection (auto). If it doesn’t work, try specifying GBK or other encodings manually.
de_de: Es wird empfohlen, Auto-Erkennung (auto) zu wählen. Falls das nicht funktioniert, versuchen Sie GBK oder andere Kodierungen manuell anzugeben.
es_es: Se recomienda elegir la detección automática (auto). Si no funciona, intenta especificar manualmente GBK u otras codificaciones.
ja_jp: 自動検出（auto）を推奨します。うまくいかない場合は GBK などのエンコードを手動で指定してみてください。
pt_br: Recomenda-se selecionar detecção automática (auto); se não funcionar, tente especificar manualmente uma codificação como GBK.
ru_ru: Рекомендуется автоопределение (auto); если не работает, попробуйте вручную указать кодировку, например GBK

# 监控模式：
source: Monitoring mode:
de_de: Überwachungsmodus:
es_es: Modo de monitorización:
ja_jp: 監視モード：
pt_br: Modo de monitoramento:
ru_ru: Режим мониторинга:

# 建议优先尝试高效模式，若无法正常获取消息，再切换至兼容模式
source: Try Efficient mode first. If messages cannot be captured properly, switch to Compatible mode.
de_de: Versuchen Sie zuerst den Effizienz-Modus. Wenn Nachrichten nicht richtig erfasst werden, auf Kompatibilitätsmodus wechseln.
es_es: Prueba primero el modo eficiente. Si no se pueden obtener bien los mensajes, cambia al modo compatible.
ja_jp: まずは高効率モードをお試しください。メッセージを正しく取得できない場合は互換モードに切り替えてください。
pt_br: Recomenda-se tentar primeiro o modo eficiente; se não conseguir obter as mensagens corretamente, mude para o modo compatível.
ru_ru: Рекомендуется сначала попробовать эффективный режим; если сообщения не захватываются, переключитесь на совместимый режим

# 高效模式
source: Efficient mode
de_de: Effizienz-Modus
es_es: Modo eficiente
ja_jp: 高効率モード
pt_br: Modo eficiente
ru_ru: Эффективный режим

# 低版本 Minecraft 推荐使用
source: Recommended for older Minecraft versions
de_de: Empfohlen für ältere Minecraft-Versionen
es_es: Recomendado para versiones antiguas de Minecraft
ja_jp: 古いバージョンの Minecraft に推奨
pt_br: Recomendado para versões antigas do Minecraft
ru_ru: Рекомендуется для старых версий Minecraft

# 兼容模式
source: Compatible mode
de_de: Kompatibilitätsmodus
es_es: Modo compatible
ja_jp: 互換モード
pt_br: Modo compatível
ru_ru: Совместимый режим

# 高版本 Minecraft 使用
source: For newer Minecraft versions
de_de: Für neuere Minecraft-Versionen
es_es: Para versiones nuevas de Minecraft
ja_jp: 新しいバージョンの Minecraft に使用
pt_br: Para versões mais recentes do Minecraft
ru_ru: Для новых версий Minecraft

# 过滤服务器消息
source: Filter server messages
de_de: Servernachrichten filtern
es_es: Filtrar mensajes del servidor
ja_jp: サーバーメッセージをフィルター
pt_br: Filtrar mensagens do servidor
ru_ru: Фильтровать сообщения сервера

# 不翻译不带玩家名称的服务器消息（系统消息）
source: Do not translate server messages without player names (system messages)
de_de: Servernachrichten ohne Spielernamen (Systemnachrichten) nicht übersetzen
es_es: No traducir mensajes del servidor sin nombre de jugador (mensajes del sistema)
ja_jp: プレイヤー名を含まないサーバーメッセージ（システムメッセージ）は翻訳しない
pt_br: Não traduzir mensagens do servidor sem nome de jogador (mensagens do sistema)
ru_ru: Не переводить серверные сообщения без имени игрока (системные сообщения)

# 替换乱码字符
source: Replace garbled characters
de_de: Fehlerhafte Zeichen ersetzen
es_es: Reemplazar caracteres ilegibles
ja_jp: 文字化けを置換
pt_br: Substituir caracteres ilegíveis
ru_ru: Заменять нечитаемые символы

# 将乱码字符（\ufffd\ufffd）替换为用于Minecraft格式化代码的分节符§（\u00A7）
source: Replace garbled characters (\ufffd\ufffd) with the section sign § (\u00A7) used for Minecraft formatting codes
de_de: Ersetzt die fehlerhaften Zeichen (\ufffd\ufffd) durch das in Minecraft-Formatierungscodes verwendete Paragraphenzeichen § (\u00A7)
es_es: Reemplazar los caracteres ilegibles (\ufffd\ufffd) por el signo de sección § (\u00A7) usado para los códigos de formato de Minecraft
ja_jp: 文字化けした文字（\ufffd\ufffd）を、Minecraft の書式コードで使用されるセクション記号 §（\u00A7）に置き換える
pt_br: Substituir os caracteres corrompidos (\ufffd\ufffd) pelo sinal de seção § (\u00A7) usado nos códigos de formatação do Minecraft
ru_ru: Заменять повреждённые символы (\ufffd\ufffd) на знак раздела § (\u00A7), используемый в кодах форматирования Minecraft

# 请输入源语言（格式不限，AI可智能识别；留空则自动检测）
source: Enter source language (any format; AI can recognize it; leave empty to auto-detect)
de_de: Bitte Ausgangssprache eingeben (beliebiges Format; KI kann sie erkennen; leer lassen für automatische Erkennung)
es_es: Introduce el idioma de origen (formato libre; la IA puede reconocerlo; déjalo en blanco para detección automática)
ja_jp: ソース言語を入力（形式は不問。AI が自動認識。未入力の場合は自動検出）
pt_br: Insira o idioma de origem (formato livre; a IA reconhece automaticamente; deixe em branco para detecção automática)
ru_ru: Введите исходный язык (любой формат; ИИ определит автоматически; оставьте пустым для автоопределения)

# 请输入目标语言（格式不限，AI可智能识别）
source: Enter target language (any format; AI can recognize it)
de_de: Bitte Zielsprache eingeben (beliebiges Format; KI kann sie erkennen)
es_es: Introduce el idioma de destino (formato libre; la IA puede reconocerlo)
ja_jp: ターゲット言語を入力（形式は不問。AI が自動認識）
pt_br: Insira o idioma de destino (formato livre; a IA reconhece automaticamente)
ru_ru: Введите целевой язык (любой формат, ИИ определит автоматически)

# 请选择源语言
source: Please select a source language
de_de: Bitte Ausgangssprache wählen
es_es: Selecciona el idioma de origen
ja_jp: ソース言語を選択してください
pt_br: Selecione o idioma de origem
ru_ru: Выберите исходный язык

# 请选择目标语言
source: Please select a target language
de_de: Bitte Zielsprache wählen
es_es: Selecciona el idioma de destino
ja_jp: ターゲット言語を選択してください
pt_br: Selecione o idioma de destino
ru_ru: Выберите целевой язык

# 翻译服务设置
source: Translation Service Settings
de_de: Einstellungen des Übersetzungsdienstes
es_es: Configuración del servicio de traducción
ja_jp: 翻訳サービス設定
pt_br: Configurações do serviço de tradução
ru_ru: Настройки службы перевода

# 玩家消息翻译服务
source: Player Message Translation Service
de_de: Übersetzungsdienst für Spielermitteilungen
es_es: Servicio de traducción de mensajes de jugadores
ja_jp: プレイヤーメッセージ翻訳サービス
pt_br: Serviço de tradução de mensagens dos jogadores
ru_ru: Служба перевода сообщений игроков

# 独立设置消息发送翻译服务
source: Set a separate translation service for sending messages
de_de: Eigenen Übersetzungsdienst für das Senden von Nachrichten festlegen
es_es: Configurar un servicio de traducción independiente para enviar mensajes
ja_jp: 送信メッセージ用に個別の翻訳サービスを設定
pt_br: Definir separadamente o serviço de tradução para envio de mensagens
ru_ru: Отдельные настройки службы перевода для отправки сообщений

# 消息发送翻译服务
source: Message Sending Translation Service
de_de: Übersetzungsdienst für das Senden von Nachrichten
es_es: Servicio de traducción para enviar mensajes
ja_jp: 送信メッセージ翻訳サービス
pt_br: Serviço de tradução para envio de mensagens
ru_ru: Служба перевода для отправки сообщений

# AI翻译
source: AI Translation
de_de: KI-Übersetzung
es_es: Traducción con IA
ja_jp: AI翻訳
pt_br: Tradução por IA
ru_ru: Перевод ИИ

# 传统翻译
source: Traditional Translation
de_de: Traditionelle Übersetzung
es_es: Traducción tradicional
ja_jp: 従来の翻訳
pt_br: Tradução tradicional
ru_ru: Традиционный перевод

# 选择服务：
source: Select service:
de_de: Dienst auswählen:
es_es: Elegir servicio:
ja_jp: サービスを選択：
pt_br: Selecionar serviço:
ru_ru: Выберите сервис:

# 请选择翻译服务
source: Please select a translation service
de_de: Bitte Übersetzungsdienst wählen
es_es: Selecciona un servicio de traducción
ja_jp: 翻訳サービスを選択してください
pt_br: Selecione um serviço de tradução
ru_ru: Выберите службу перевода

source: API Key:
de_de: API-Schlüssel:
es_es: Clave API:
ja_jp: APIキー：
pt_br: Chave da API:
ru_ru: Ключ API:

# 请输入您的API Key
source: Please enter your API key
de_de: Bitte Ihren API-Schlüssel eingeben
es_es: Introduce tu clave API
ja_jp: APIキーを入力してください
pt_br: Insira sua chave da API
ru_ru: Введите ваш ключ API

# API地址：
source: API endpoint:
de_de: API-Endpunkt:
es_es: Extremo de la API:
ja_jp: API エンドポイント：
pt_br: Endereço da API:
ru_ru: Адрес API:

# 默认端点
source: Default endpoint
de_de: Standard-Endpunkt
es_es: Extremo predeterminado
ja_jp: デフォルトエンドポイント
pt_br: Endpoint padrão
ru_ru: Конечная точка по умолчанию

# 模型代号：
source: Model ID:
de_de: Modell-ID:
es_es: ID del modelo:
ja_jp: モデルID：
pt_br: Código do modelo:
ru_ru: Идентификатор модели:

# 请输入模型代号，如：gpt-3.5-turbo
source: Enter a model ID, e.g., gpt-3.5-turbo
de_de: Bitte eine Modell-ID eingeben, z. B.: gpt-3.5-turbo
es_es: Introduce el ID del modelo, p. ej.: gpt-3.5-turbo
ja_jp: モデルIDを入力してください（例：gpt-3.5-turbo）
pt_br: Insira o código do modelo, por exemplo: gpt-3.5-turbo
ru_ru: Введите идентификатор модели, например: gpt-3.5-turbo

# 深度翻译模式：
source: Deep Translation Mode:
de_de: Modus für Tiefenübersetzung:
es_es: Modo de traducción profunda:
ja_jp: ディープ翻訳モード：
pt_br: Modo de Tradução Profunda:
ru_ru: Режим глубокого перевода:

# 启用显式思维链（Chain of Thought）翻译策略 优点：提供更高质量的翻译 缺点：一定程度增加token消耗，响应延迟提高
source: Enable explicit Chain of Thought translation strategy Pros: Provides higher-quality translations Cons: Increases token usage to some extent and increases response latency
de_de: Aktiviert die explizite Chain-of-Thought-Übersetzungsstrategie Vorteile: Liefert Übersetzungen in höherer Qualität Nachteile: Erhöht bis zu einem gewissen Grad den Token-Verbrauch und die Antwortlatenz
es_es: Habilitar la estrategia de traducción con Cadena de Pensamiento (Chain of Thought) Ventajas: proporciona traducciones de mayor calidad Desventajas: aumenta en cierta medida el consumo de tokens y la latencia de respuesta
ja_jp: 明示的な思考連鎖（Chain of Thought）翻訳戦略を有効化 長所：より高品質な翻訳を提供 短所：トークン消費がある程度増加し、応答遅延が長くなる
pt_br: Ativar a estratégia de tradução com Cadeia de Pensamento (Chain of Thought) Vantagens: fornece traduções de maior qualidade Desvantagens: aumenta, em certa medida, o consumo de tokens e a latência de resposta
ru_ru: Включить стратегию перевода с явной цепочкой рассуждений (Chain of Thought) Плюсы: обеспечивает более высокое качество перевода Минусы: в некоторой степени увеличивает расход токенов и задержку отклика

# 关闭
source: Close
de_de: Schließen
es_es: Cerrar
ja_jp: 閉じる
pt_br: Fechar
ru_ru: Закрыть

# 开启
source: Enable
de_de: Aktivieren
es_es: Activar
ja_jp: 有効化
pt_br: Ativar
ru_ru: Включить

# 不使用
source: Do not use
de_de: Nicht verwenden
es_es: No usar
ja_jp: 使用しない
pt_br: Não usar
ru_ru: Не использовать

# 翻译结果显示
source: Translation Result Display
de_de: Anzeige des Übersetzungsergebnisses
es_es: Visualización del resultado de la traducción
ja_jp: 翻訳結果の表示
pt_br: Exibição dos resultados da tradução
ru_ru: Отображение результата перевода

# 网页端口：
source: Web port:
es_es: Puerto web:
ja_jp: Web ポート：
pt_br: Porta da Web:
ru_ru: Порт веб-интерфейса:

# 消息发送设置
source: Message Sending Settings
de_de: Einstellungen zum Senden von Nachrichten
es_es: Configuración de envío de mensajes
ja_jp: メッセージ送信設定
pt_br: Configurações de envio de mensagens
ru_ru: Настройки отправки сообщений

# 监控剪切板
source: Monitor clipboard
de_de: Zwischenablage überwachen
es_es: Supervisar el portapapeles
ja_jp: クリップボードを監視
pt_br: Monitorar a área de transferência
ru_ru: Отслеживать буфер обмена

# 从剪切板获取要发送的消息
source: Get messages to send from the clipboard
de_de: Zu sendende Nachrichten aus der Zwischenablage holen
es_es: Obtener del portapapeles los mensajes a enviar
ja_jp: 送信するメッセージをクリップボードから取得
pt_br: Obter a mensagem a ser enviada da área de transferência
ru_ru: Получать отправляемые сообщения из буфера обмена

# 术语表管理
source: Glossary Management
de_de: Glossar-Verwaltung
es_es: Gestión del glosario
ja_jp: 用語集の管理
pt_br: Gerenciamento do glossário
ru_ru: Управление глоссарием

# 源术语：
source: Source term:
de_de: Quellbegriff:
es_es: Término origen:
ja_jp: ソース用語：
pt_br: Termo de origem:
ru_ru: Исходный термин:

# 请输入源术语
source: Please enter a source term
de_de: Bitte Quellbegriff eingeben
es_es: Introduce el término de origen
ja_jp: ソース用語を入力してください
pt_br: Insira o termo de origem
ru_ru: Введите исходный термин

# 目标术语：
source: Target term:
de_de: Zielbegriff:
es_es: Término destino:
ja_jp: ターゲット用語：
pt_br: Termo de destino:
ru_ru: Целевой термин:

# 请输入目标术语
source: Please enter a target term
de_de: Bitte Zielbegriff eingeben
es_es: Introduce el término de destino
ja_jp: ターゲット用語を入力してください
pt_br: Insira o termo de destino
ru_ru: Введите целевой термин

# 添加/更新术语
source: Add/Update term
de_de: Begriff hinzufügen/aktualisieren
es_es: Agregar/actualizar término
ja_jp: 用語を追加/更新
pt_br: Adicionar/atualizar termo
ru_ru: Добавить/обновить термин

# 清空输入
source: Clear input
de_de: Eingabe leeren
es_es: Limpiar entrada
ja_jp: 入力をクリア
pt_br: Limpar entrada
ru_ru: Очистить ввод

# 源术语
source: Source term
de_de: Quellbegriff
es_es: Término origen
ja_jp: ソース用語
pt_br: Termo de origem
ru_ru: Исходный термин

# 目标术语
source: Target term
de_de: Zielbegriff
es_es: Término destino
ja_jp: ターゲット用語
pt_br: Termo de destino
ru_ru: Целевой термин

# 删除选中术语
source: Delete selected terms
de_de: Ausgewählte Begriffe löschen
es_es: Eliminar términos seleccionados
ja_jp: 選択した用語を削除
pt_br: Excluir termos selecionados
ru_ru: Удалить выбранные термины

# 清空术语
source: Clear terms
de_de: Begriffe leeren
es_es: Vaciar términos
ja_jp: 用語をクリア
pt_br: Limpar glossário
ru_ru: Очистить глоссарий

# 输入错误
source: Input error
de_de: Eingabefehler
es_es: Error de entrada
ja_jp: 入力エラー
pt_br: Erro de entrada
ru_ru: Ошибка ввода

# 源术语不能为空
source: Source term cannot be empty
de_de: Quellbegriff darf nicht leer sein
es_es: El término de origen no puede estar vacío
ja_jp: ソース用語は空にできません
pt_br: O termo de origem não pode estar vazio
ru_ru: Исходный термин не может быть пустым

# 确认覆盖
source: Confirm overwrite
de_de: Überschreiben bestätigen
es_es: Confirmar sobrescritura
ja_jp: 上書きの確認
pt_br: Confirmar substituição
ru_ru: Подтвердить перезапись

# 源术语 "{}" 已存在，是否覆盖？
source: The source term “{}” already exists. Overwrite?
de_de: Der Quellbegriff „{}“ existiert bereits. Überschreiben?
es_es: El término de origen «{}» ya existe. ¿Sobrescribir?
ja_jp: ソース用語「{}」は既に存在します。上書きしますか？
pt_br: O termo de origem “{}” já existe. Deseja substituí-lo?
ru_ru: Исходный термин «{}» уже существует. Перезаписать?

# 更新
source: Update
de_de: Aktualisieren
es_es: Actualizar
ja_jp: 更新
pt_br: Atualizar
ru_ru: Обновить

# 添加
source: Add
de_de: Hinzufügen
es_es: Agregar
ja_jp: 追加
pt_br: Adicionar
ru_ru: Добавить

# 术语{}成功
source: Term {} succeeded
de_de: Begriff {} erfolgreich
es_es: Término {} con éxito
ja_jp: 用語{}に成功
pt_br: Termo {} com sucesso
ru_ru: Действие «{}» с термином выполнено успешно

# 删除成功
source: Deleted successfully
de_de: Erfolgreich gelöscht
es_es: Eliminado correctamente
ja_jp: 削除に成功しました
pt_br: Excluído com sucesso
ru_ru: Удаление успешно

# 术语 "{}" 已删除
source: The term “{}” has been deleted
de_de: Begriff „{}“ wurde gelöscht
es_es: El término «{}» ha sido eliminado
ja_jp: 用語「{}」を削除しました
pt_br: O termo “{}” foi excluído
ru_ru: Термин «{}» удалён

# 提示
source: Notice
de_de: Hinweis
es_es: Aviso
ja_jp: ヒント
pt_br: Aviso
ru_ru: Подсказка

# 术语表为空，无需清空
source: The glossary is empty; no need to clear
de_de: Glossar ist leer; Leeren nicht erforderlich
es_es: El glosario está vacío; no es necesario vaciarlo
ja_jp: 用語集は空です。クリアする必要はありません
pt_br: O glossário está vazio; não há nada para limpar
ru_ru: Глоссарий пуст, очищать нечего

# 确认清空
source: Confirm clear
de_de: Leeren bestätigen
es_es: Confirmar vaciado
ja_jp: クリアの確認
pt_br: Confirmar limpeza
ru_ru: Подтвердить очистку

# 确定要清空所有术语吗？此操作不可恢复。
source: Are you sure you want to clear all terms? This action cannot be undone.
de_de: Alle Begriffe wirklich leeren? Dieser Vorgang kann nicht rückgängig gemacht werden.
es_es: ¿Seguro que deseas vaciar todos los términos? Esta acción no se puede deshacer.
ja_jp: すべての用語をクリアしてもよろしいですか？この操作は元に戻せません。
pt_br: Tem certeza de que deseja limpar todos os termos? Esta ação não pode ser desfeita.
ru_ru: Вы уверены, что хотите очистить все термины? Это действие необратимо.

# 清空成功
source: Cleared successfully
de_de: Leeren erfolgreich
es_es: Vaciado correcto
ja_jp: クリアに成功しました
pt_br: Limpeza concluída
ru_ru: Очистка успешно выполнена

# 已清空 {} 个术语
source: {} terms cleared
de_de: {} Begriffe geleert
es_es: {} términos vaciados
ja_jp: {} 件の用語をクリアしました
pt_br: Foram limpos {} termos
ru_ru: Очищено {} терминов

# 启动
source: Start
de_de: Starten
es_es: Iniciar
ja_jp: 起動
pt_br: Iniciar
ru_ru: Запустить

# 直接启动
source: Start directly
de_de: Direkt starten
es_es: Iniciar directamente
ja_jp: 直接起動
pt_br: Iniciar diretamente
ru_ru: Запустить напрямую

# 保存配置并启动
source: Save configuration and start
es_es: Guardar configuración e iniciar
ja_jp: 設定を保存して起動
pt_br: Salvar configuração e iniciar
ru_ru: Сохранить конфигурацию и запустить

# 保存配置
source: Save configuration
de_de: Konfiguration speichern
es_es: Guardar configuración
ja_jp: 設定を保存
pt_br: Salvar configuração
ru_ru: Сохранить конфигурацию

# 工作中
source: Working
es_es: En ejecución
ja_jp: 稼働中
pt_br: Em execução
ru_ru: Работает

# 已停止
source: Stopped
es_es: Detenido
ja_jp: 停止しました
pt_br: Parado
ru_ru: Остановлено

# Web访问链接
source: Web Access Links
es_es: Enlaces de acceso web
ja_jp: Web アクセスリンク
pt_br: Links de acesso à Web
ru_ru: Ссылка для доступа к веб-интерфейсу

# 请通过以下任一链接打开网页界面，查看翻译并即时发送消息
source: Please open the web interface via any of the links below to view translations and send messages in real time
es_es: Abre la interfaz web mediante cualquiera de los enlaces siguientes para ver las traducciones y enviar mensajes al instante
ja_jp: 以下のいずれかのリンクから Web インターフェイスを開き、翻訳を確認して即時にメッセージを送信してください
pt_br: Abra a interface web por qualquer um dos links abaixo para ver as traduções e enviar mensagens em tempo real
ru_ru: Пожалуйста, откройте веб-интерфейс по любой из следующих ссылок, чтобы просмотреть перевод и отправить сообщение мгновенно

# 已启动
source: Started
de_de: Gestartet
es_es: Iniciado
ja_jp: 起動しました
pt_br: Iniciado
ru_ru: Запущено

# 已根据当前界面配置启动
source: Started according to the current interface configuration
es_es: Iniciado según la configuración actual de la interfaz
ja_jp: 現在の画面設定に基づいて起動しました
pt_br: Iniciado com base na configuração atual da interface
ru_ru: Запущено в соответствии с текущей конфигурацией интерфейса

# 启动失败
source: Failed to start
de_de: Start fehlgeschlagen
es_es: Error al iniciar
ja_jp: 起動に失敗しました
pt_br: Falha ao iniciar
ru_ru: Не удалось запустить

# 保存配置失败
source: Failed to save configuration
es_es: Error al guardar la configuración
ja_jp: 設定の保存に失敗しました
pt_br: Falha ao salvar a configuração
ru_ru: Не удалось сохранить конфигурацию

# 已保存
source: Saved
de_de: Gespeichert
es_es: Guardado
ja_jp: 保存しました
pt_br: Salvo
ru_ru: Сохранено

# 配置已保存，但未设置启动回调
source: Configuration saved, but no startup callback set
es_es: La configuración se ha guardado, pero no se ha configurado el callback de inicio
ja_jp: 設定は保存されましたが、起動コールバックが設定されていません
pt_br: Configuração salva, mas o retorno de chamada de inicialização não foi definido
ru_ru: Конфигурация сохранена, но не установлен обратный вызов запуска

# 已保存并启动
source: Saved and started
es_es: Guardado e iniciado
ja_jp: 保存して起動しました
pt_br: Salvo e iniciado
ru_ru: Сохранено и запущено

# 配置已保存并启动
source: Configuration saved and started
de_de: Konfiguration gespeichert und gestartet
es_es: Configuración guardada e iniciada
ja_jp: 設定を保存して起動しました
pt_br: Configuração salva e iniciada
ru_ru: Конфигурация сохранена и запущена

# 操作失败
source: Operation failed
de_de: Vorgang fehlgeschlagen
es_es: Operación fallida
ja_jp: 操作に失敗しました
pt_br: Falha na operação
ru_ru: Операция не удалась

# 保存成功
source: Saved successfully
de_de: Speichern erfolgreich
es_es: Guardado correctamente
ja_jp: 保存に成功しました
pt_br: Salvo com sucesso
ru_ru: Успешно сохранено

# 配置已保存至文件
source: Configuration saved to file
de_de: Konfiguration in Datei gespeichert
es_es: La configuración se ha guardado en el archivo
ja_jp: 設定がファイルに保存されました
pt_br: A configuração foi salva no arquivo
ru_ru: Конфигурация сохранена в файл

# 保存失败
source: Save failed
de_de: Speichern fehlgeschlagen
es_es: Error al guardar
ja_jp: 保存に失敗しました
pt_br: Falha ao salvar
ru_ru: Ошибка сохранения

# 写入配置文件失败
source: Failed to write configuration file
es_es: Error al escribir el archivo de configuración
ja_jp: 設定ファイルへの書き込みに失敗しました
pt_br: Falha ao gravar o arquivo de configuração
ru_ru: Не удалось записать конфигурационный файл

# 应用信息
source: About the app
de_de: App-Informationen
es_es: Información de la aplicación
ja_jp: アプリ情報
pt_br: Informações do aplicativo
ru_ru: Сведения о приложении

# 版本
source: Version
es_es: Versión
ja_jp: バージョン
pt_br: Versão
ru_ru: Версия

# 作者
source: Author
de_de: Autor
es_es: Autor
ja_jp: 作者
pt_br: Autor
ru_ru: Автор

# 邮箱
source: Email
es_es: Correo electrónico
ja_jp: メール
ru_ru: Эл. почта

# 相关链接
source: Related links
de_de: Relevante Links
es_es: Enlaces relacionados
ja_jp: 関連リンク
pt_br: Links relacionados
ru_ru: Ссылки

# 许可证
source: License
de_de: Lizenz
es_es: Licencia
ja_jp: ライセンス
pt_br: Licença
ru_ru: Лицензия

# 发现新版本
source: New version found
de_de: Neue Version gefunden
es_es: Nueva versión encontrada
ja_jp: 新しいバージョンを発見
pt_br: Nova versão encontrada
ru_ru: Найдена новая версия

# 创建更新对话框时出错: {}
source: Error creating update dialog: {}
de_de: Fehler beim Erstellen des Update-Dialogs: {}
es_es: Error al crear el cuadro de actualización: {}
ja_jp: アップデートダイアログの作成中にエラーが発生しました: {}
pt_br: Erro ao criar a caixa de diálogo de atualização: {}
ru_ru: Ошибка при создании диалога обновления: {}
