Repository: LiJiaHua1024/ModlessChatTrans
Catalog: i18n/*.po
Languages: de_de, es_es, ja_jp, pt_br, ru_ru

# 下载更新
source: Download update
de_de: Update herunterladen
es_es: Descargar actualización
ja_jp: アップデートをダウンロード
pt_br: Baixar atualização
ru_ru: Скачать обновление

# 暂不更新
source: Not now
de_de: Später
es_es: Ahora no
ja_jp: 後で
pt_br: Não atualizar agora
ru_ru: Не обновлять сейчас

# 版本信息
source: Version information
de_de: Versionsinformationen
es_es: Información de la versión
ja_jp: バージョン情報
pt_br: Informações da versão
ru_ru: Информация о версии

# 当前版本：
source: Current version:
de_de: Aktuelle Version:
es_es: Versión actual:
ja_jp: 現在のバージョン：
pt_br: Versão atual:
ru_ru: Текущая версия:

# 最新版本：
source: Latest version:
de_de: Neueste Version:
es_es: Última versión:
ja_jp: 最新バージョン：
pt_br: Versão mais recente:
ru_ru: Последняя версия:

# 未知
source: Unknown
de_de: Unbekannt
es_es: Desconocido
ja_jp: 不明
pt_br: Desconhecido
ru_ru: Неизвестно

# 发布时间：
source: Release date:
de_de: Veröffentlichungsdatum:
es_es: Fecha de lanzamiento:
ja_jp: リリース日：
pt_br: Data de lançamento:
ru_ru: Дата выпуска:

# 发布者：
source: Publisher:
de_de: Veröffentlicher:
es_es: Publicador:
ja_jp: 公開者：
pt_br: Publicado por:
ru_ru: Опубликовал:

# 版本类型：
source: Release type:
de_de: Versionstyp:
es_es: Tipo de versión:
ja_jp: バージョン種別：
pt_br: Tipo de versão:
ru_ru: Тип версии:

# 预发布版本
source: Pre-release
de_de: Vorabveröffentlichung
es_es: Versión preliminar
ja_jp: プレリリース
pt_br: Pré-lançamento
ru_ru: Предварительная версия

# 更新说明
source: Release notes
de_de: Versionshinweise
es_es: Notas de la versión
ja_jp: 更新内容
pt_br: Notas da atualização
ru_ru: Описание обновления

# 暂无更新说明
source: No release notes available
de_de: Keine Versionshinweise verfügbar
es_es: No hay notas de la versión disponibles
ja_jp: 更新内容はありません
pt_br: Sem notas de atualização
ru_ru: Описание обновления отсутствует

# 在 GitHub 上查看完整说明
source: View full notes on GitHub
de_de: Vollständige Hinweise auf GitHub anzeigen
es_es: Ver notas completas en GitHub
ja_jp: GitHub で詳細を表示
pt_br: Ver notas completas no GitHub
ru_ru: Посмотреть полное описание на GitHub

# 正在下载更新
source: Downloading update
de_de: Update wird heruntergeladen
es_es: Descargando actualización
ja_jp: アップデートをダウンロード中
pt_br: Baixando atualização
ru_ru: Загрузка обновления

# 取消
source: Cancel
de_de: Abbrechen
es_es: Cancelar
ja_jp: キャンセル
pt_br: Cancelar
ru_ru: Отмена

# 正在下载版本 {}...
source: Downloading version {}...
de_de: Version {} wird heruntergeladen...
es_es: Descargando la versión {}...
ja_jp: バージョン {} をダウンロード中...
pt_br: Baixando a versão {}...
ru_ru: Загружается версия {}...

# 下载进度：
source: Progress:
de_de: Fortschritt:
es_es: Progreso:
ja_jp: ダウンロードの進行状況：
pt_br: Progresso do download:
ru_ru: Ход загрузки:

# 下载速度：
source: Speed:
de_de: Geschwindigkeit:
es_es: Velocidad:
ja_jp: ダウンロード速度：
pt_br: Velocidade do download:
ru_ru: Скорость загрузки:

# 剩余时间：
source: Time left:
de_de: Verbleibende Zeit:
es_es: Tiempo restante:
ja_jp: 残り時間：
pt_br: Tempo restante:
ru_ru: Оставшееся время:

# 计算中...
source: Calculating...
de_de: Wird berechnet...
es_es: Calculando...
ja_jp: 計算中...
pt_br: Calculando...
ru_ru: Рассчитывается...

# 下载方式：
source: Download method:
de_de: Download-Methode:
es_es: Método de descarga:
ja_jp: ダウンロード方式：
pt_br: Modo de download:
ru_ru: Способ загрузки:

# 检测中...
source: Detecting...
de_de: Wird ermittelt...
es_es: Detectando...
ja_jp: 検出中...
pt_br: Verificando...
ru_ru: Проверка...

# {} 线程下载
source: {}-thread download
es_es: Descarga con {} hilos
ja_jp: {} スレッドでダウンロード
pt_br: Download com {} threads
ru_ru: Загрузка в {} потоков

# 单线程下载
source: Single-thread download
de_de: Einzel-Thread-Download
es_es: Descarga de un solo hilo
ja_jp: 単一スレッドでダウンロード
pt_br: Download com um único thread
ru_ru: Однопоточная загрузка

# {} 秒
source: {} seconds
de_de: {} Sekunden
es_es: {} segundos
ja_jp: {} 秒
pt_br: {} s
ru_ru: {} сек.

# {} 分 {} 秒
source: {} min {} s
de_de: {} Min {} Sek
ja_jp: {} 分 {} 秒
ru_ru: {} мин {} сек.

# {} 分钟
source: {} minutes
de_de: {} Minuten
es_es: {} minutos
ja_jp: {} 分
pt_br: {} minutos
ru_ru: {} мин.

# {} 小时 {} 分
source: {} h {} min
de_de: {} Std {} Min
ja_jp: {} 時間 {} 分
ru_ru: {} ч {} мин.

# {} 小时
source: {} hours
de_de: {} Stunden
es_es: {} horas
ja_jp: {} 時間
pt_br: {} horas
ru_ru: {} ч.

# 完成
source: Done
de_de: Fertig
es_es: Completado
ja_jp: 完了
pt_br: Concluído
ru_ru: Готово

# 正在取消...
source: Canceling...
de_de: Wird abgebrochen...
es_es: Cancelando...
ja_jp: キャンセル中...
pt_br: Cancelando...
ru_ru: Отмена...

# 错误
source: Error
de_de: Fehler
ja_jp: エラー
pt_br: Erro
ru_ru: Ошибка

# 设置
source: Settings
de_de: Einstellungen
es_es: Configuración
ja_jp: 設定
pt_br: Configurações
ru_ru: Настройки

# 语言设置
source: Language settings
de_de: Spracheinstellungen
es_es: Configuración de idioma
ja_jp: 言語設定
pt_br: Configurações de idioma
ru_ru: Языковые настройки

# 界面语言：
source: Interface language:
de_de: Oberflächensprache:
es_es: Idioma de la interfaz:
ja_jp: UI 言語：
pt_br: Idioma da interface:
ru_ru: Язык интерфейса:

# 保存
source: Save
de_de: Speichern
es_es: Guardar
ja_jp: 保存
pt_br: Salvar
ru_ru: Сохранить

# * 语言更改将在重启后生效
source: * Language changes will take effect after restart
de_de: * Sprachänderungen werden nach einem Neustart wirksam
es_es: * Los cambios de idioma surtirán efecto tras reiniciar
ja_jp: * 言語の変更は再起動後に有効になります
pt_br: * A alteração de idioma terá efeito após reiniciar
ru_ru: * Изменение языка вступит в силу после перезапуска

# 更新设置
source: Update settings
de_de: Update-Einstellungen
es_es: Configuración de actualizaciones
ja_jp: 更新設定
pt_br: Configurações de atualização
ru_ru: Настройки обновлений

# 自动检查：
source: Auto-check:
de_de: Automatische Prüfung:
es_es: Comprobación automática:
ja_jp: 自動チェック：
pt_br: Verificação automática:
ru_ru: Автопроверка:

# 启动时
source: On startup
de_de: Beim Start
es_es: Al iniciar
ja_jp: 起動時
pt_br: Ao iniciar
ru_ru: При запуске

# 每天
source: Daily
de_de: Täglich
es_es: Diariamente
ja_jp: 毎日
pt_br: Diariamente
ru_ru: Ежедневно

# 每周
source: Weekly
de_de: Wöchentlich
es_es: Semanalmente
ja_jp: 毎週
pt_br: Semanalmente
ru_ru: Еженедельно

# 每月
source: Monthly
de_de: Monatlich
es_es: Mensualmente
ja_jp: 毎月
pt_br: Mensalmente
ru_ru: Ежемесячно

# 从不
source: Never
de_de: Nie
es_es: Nunca
ja_jp: しない
pt_br: Nunca
ru_ru: Никогда

# 预发布版本：
source: Pre-releases:
de_de: Vorabversionen:
es_es: Versiones preliminares:
ja_jp: プレリリース：
pt_br: Pré-lançamentos:
ru_ru: Предрелизные версии:

# 包含预发布版本
source: Include pre-releases
de_de: Vorabversionen einschließen
es_es: Incluir versiones preliminares
ja_jp: プレリリースを含める
pt_br: Incluir versões de pré-lançamento
ru_ru: Включать предрелизные версии

# 手动检查：
source: Manual check:
de_de: Manuelle Prüfung:
es_es: Comprobación manual:
ja_jp: 手動チェック：
pt_br: Verificação manual:
ru_ru: Проверка вручную:

# 检查更新
source: Check for updates
de_de: Nach Updates suchen
es_es: Buscar actualizaciones
ja_jp: アップデートを確認
pt_br: Verificar atualizações
ru_ru: Проверить обновления

# 设置已保存
source: Settings saved
de_de: Einstellungen gespeichert
es_es: Configuración guardada
ja_jp: 設定を保存しました
pt_br: Configurações salvas
ru_ru: Настройки сохранены

# 界面语言已设置为 {}，重启后生效。
source: Interface language set to {}. Takes effect after restart.
de_de: Oberflächensprache auf {} gesetzt. Wirksam nach Neustart.
es_es: El idioma de la interfaz se estableció en {}. Entrará en vigor tras reiniciar.
ja_jp: UI 言語を {} に設定しました。再起動後に有効になります。
pt_br: O idioma da interface foi definido como {}; entrará em vigor após reiniciar.
ru_ru: Язык интерфейса установлен на {}, изменения вступят в силу после перезапуска.

# 更新器未初始化
source: Updater not initialized
de_de: Updater nicht initialisiert
es_es: Actualizador no inicializado
ja_jp: アップデーターが初期化されていません
pt_br: O atualizador não foi inicializado
ru_ru: Обновитель не инициализирован

# 检查更新失败
source: Failed to check for updates
de_de: Fehler bei der Update-Prüfung
es_es: Error al comprobar actualizaciones
ja_jp: アップデートの確認に失敗しました
pt_br: Falha ao verificar atualizações
ru_ru: Не удалось проверить обновления

# 错误: {}
source: Error: {}
de_de: Fehler: {}
ja_jp: エラー: {}
pt_br: Erro: {}
ru_ru: Ошибка: {}

# 未知版本
source: Unknown version
de_de: Unbekannte Version
es_es: Versión desconocida
ja_jp: 不明なバージョン
pt_br: Versão desconhecida
ru_ru: Неизвестная версия

# 最新版本: {} 当前版本: v{} 是否在浏览器中查看？
source: Latest version: {} Current version: v{} Open in browser?
de_de: Neueste Version: {} Aktuelle Version: v{} Im Browser anzeigen?
es_es: Última versión: {} Versión actual: v{} ¿Abrir en el navegador?
ja_jp: 最新バージョン: {} 現在のバージョン: v{} ブラウザーで表示しますか？
pt_br: Versão mais recente: {} Versão atual: v{} Deseja abrir no navegador?
ru_ru: Последняя версия: {} Текущая версия: v{} Открыть в браузере?

# 您是最新的
source: You're up to date
de_de: Bereits auf dem neuesten Stand
es_es: Ya tienes la última versión
ja_jp: すでに最新バージョンです
pt_br: Você já está na versão mais recente
ru_ru: У вас последняя версия

# 当前版本 v{} 已是最新版本
source: Current version v{} is already the latest
de_de: Aktuelle Version v{} ist bereits die neueste
es_es: La versión actual v{} ya es la más reciente
ja_jp: 現在のバージョン v{} は最新です
pt_br: A versão atual v{} já é a mais recente
ru_ru: Текущая версия v{} является последней

# 下载完成
source: Download complete
de_de: Download abgeschlossen
es_es: Descarga completada
ja_jp: ダウンロード完了
pt_br: Download concluído
ru_ru: Загрузка завершена

# 更新文件已下载到: {} 请手动安装更新。
source: The update file has been downloaded to: {} Please install the update manually.
de_de: Die Update-Datei wurde heruntergeladen nach: {} Bitte installieren Sie das Update manuell.
es_es: El archivo de actualización se ha descargado en: {} Instala la actualización manualmente.
ja_jp: 更新ファイルをダウンロードしました: {} 手動で更新をインストールしてください。
pt_br: O arquivo de atualização foi baixado em: {} Instale a atualização manualmente.
ru_ru: Файл обновления загружен в: {} Пожалуйста, установите обновление вручную.

# 下载已取消
source: Download canceled
de_de: Download abgebrochen
es_es: Descarga cancelada
ja_jp: ダウンロードをキャンセルしました
pt_br: Download cancelado
ru_ru: Загрузка отменена

# 更新下载已取消
source: Update download has been canceled
de_de: Update-Download wurde abgebrochen
es_es: La descarga de la actualización se ha cancelado
ja_jp: 更新のダウンロードはキャンセルされました
pt_br: O download da atualização foi cancelado
ru_ru: Загрузка обновления отменена

# 消息捕获
source: Message Capture
de_de: Nachrichtenerfassung
es_es: Captura de mensajes
ja_jp: メッセージキャプチャ
pt_br: Captura de mensagens
ru_ru: Перехват сообщений

# 翻译服务
source: Translation Service
de_de: Übersetzungsdienst
es_es: Servicio de traducción
ja_jp: 翻訳サービス
pt_br: Serviço de tradução
ru_ru: Служба перевода

# 发送消息
source: Send Message
de_de: Nachricht senden
es_es: Enviar mensaje
ja_jp: メッセージ送信
pt_br: Enviar mensagens
ru_ru: Отправка сообщений

# 术语表
source: Glossary
de_de: Glossar
es_es: Glosario
ja_jp: 用語集
pt_br: Glossário
ru_ru: Глоссарий

# 关于
source: About
de_de: Über
es_es: Acerca de
ja_jp: このアプリについて
pt_br: Sobre
ru_ru: О программе

# 语言加载错误
source: Language load error
de_de: Fehler beim Laden der Sprache
es_es: Error al cargar el idioma
ja_jp: 言語の読み込みエラー
pt_br: Erro ao carregar idiomas
ru_ru: Ошибка загрузки языка

# 获取支持语言失败 ({service_id}): {error_msg}
source: Failed to get supported languages ({service_id}): {error_msg}
de_de: Abrufen der unterstützten Sprachen fehlgeschlagen ({service_id}): {error_msg}
es_es: Error al obtener los idiomas compatibles ({service_id}): {error_msg}
ja_jp: 対応言語の取得に失敗しました（{service_id}）：{error_msg}
pt_br: Falha ao obter idiomas suportados ({service_id}): {error_msg}
ru_ru: Не удалось получить список поддерживаемых языков ({service_id}): {error_msg}

# 翻译失败：请求次数过多，请稍后重试。
source: Translation failed: Too many requests. Please try again later.
de_de: Übersetzung fehlgeschlagen: Zu viele Anfragen. Bitte später erneut versuchen.
es_es: Error de traducción: demasiadas solicitudes. Inténtalo de nuevo más tarde.
ja_jp: 翻訳に失敗しました：リクエストが多すぎます。しばらくしてからお試しください。
pt_br: Falha na tradução: solicitações em excesso; tente novamente mais tarde.
ru_ru: Ошибка перевода: слишком много запросов, попробуйте позже.

# 翻译失败：服务器错误，请稍后重试。
source: Translation failed: Server error. Please try again later.
de_de: Übersetzung fehlgeschlagen: Serverfehler. Bitte später erneut versuchen.
es_es: Error de traducción: error del servidor. Inténtalo de nuevo más tarde.
ja_jp: 翻訳に失敗しました：サーバーエラーが発生しました。しばらくしてからお試しください。
pt_br: Falha na tradução: erro do servidor; tente novamente mais tarde.
ru_ru: Ошибка перевода: ошибка сервера, попробуйте позже.

# 翻译失败：发生HTTP错误。
source: Translation failed: An HTTP error occurred.
de_de: Übersetzung fehlgeschlagen: HTTP-Fehler aufgetreten.
es_es: Error de traducción: se produjo un error HTTP.
ja_jp: 翻訳に失敗しました：HTTPエラーが発生しました。
pt_br: Falha na tradução: ocorreu um erro HTTP.
ru_ru: Ошибка перевода: произошла ошибка HTTP.

# 翻译失败：网络问题或发生HTTP错误。
source: Translation failed: Network issue or HTTP error occurred.
de_de: Übersetzung fehlgeschlagen: Netzwerkproblem oder HTTP-Fehler.
es_es: Error de traducción: problema de red o error HTTP.
ja_jp: 翻訳に失敗しました：ネットワークの問題またはHTTPエラーが発生しました。
pt_br: Falha na tradução: problema de rede ou erro HTTP.
ru_ru: Ошибка перевода: проблемы с сетью или ошибка HTTP.

# 翻译失败：服务器响应无效，请检查网络连接。
source: Translation failed: Invalid server response. Please check your network connection.
de_de: Übersetzung fehlgeschlagen: Ungültige Serverantwort. Bitte Netzwerkverbindung prüfen.
es_es: Error de traducción: respuesta del servidor no válida. Verifica tu conexión de red.
ja_jp: 翻訳に失敗しました：サーバーの応答が無効です。ネットワーク接続を確認してください。
pt_br: Falha na tradução: resposta inválida do servidor; verifique a conexão de rede.
ru_ru: Ошибка перевода: недопустимый ответ сервера, проверьте соединение с сетью.

# 翻译失败，错误：
source: Translation failed, error:
de_de: Übersetzung fehlgeschlagen, Fehler:
es_es: Error de traducción, error:
ja_jp: 翻訳に失敗しました。エラー：
pt_br: Falha na tradução. Erro:
ru_ru: Ошибка перевода:
